/* Localized versions of Info.plist keys */

AMName = "Wake Machine";

/*  AMApplication localized strings  */
/* e.g. "Terminal" = "Terminal"; */

/*  AMCategory localized strings  */
/* e.g. "Terminal" = "Terminal"; */

/*  AMDefaultParameters localized values  */
/*  e.g. myDefaultIntegerParameter = 0;  */
/*  e.g. myDefaultStringParameter = "Default String Value";  */

/*  AMDescription localized strings  */
AMDInput = "Accepts any string input (e.g. file paths)";
AMDNote = "You should ensure that the remote machine is setup to such that it can be woken up via network interfaces";
AMDOptions = "You must supply the MAC and IP addresses for the remote machine";
AMDResult = "Passes filenames, etc through to next action";
AMDRequires = "A remote machine setup to to be wakeable via the network";
AMDSummary = "Wakes a remote machine from a sleeping state";
AMDWebsite = "http://interblah.net/wake-remote-machine-automator-action";

/*  AMKeyword localized strings  */
/* e.g. "Filter" = "Filter"; */

/*  AMWarning localized strings  */
//ApplyButton = "(* Button label for user to add proposed Action, e.g. Add. *)";
//IgnoreButton = "(* Button label for user not to add proposed Action, e.g. Don't Add. *)";
//Message = "(* Warning message presented to user goes here. *)";
